[
    {
        "id": 1,
        "title": "Servicio Ya",
        "description": "Aplicación móvil para Android desarrollada con Flutter y Laravel, que conecta clientes y profesionales para la gestión eficiente de servicios. Permite registro con Google, perfiles completos, solicitudes rápidas o con presupuestos, seguimiento en tiempo real y comunicación directa vía WhatsApp. Incluye sistema de calificaciones, notificaciones push y un panel administrativo. Además, cuenta con una página web en React y Next.js, garantizando usabilidad, escalabilidad y una experiencia fluida.",
        "image": "/assets/servicioya.png",
        "link": "https://appservicioya.com/"
    },
    {
        "id": 2,
        "title": "e-Commerce",
        "description": "Plataforma de comercio electrónico moderna con frontend en React y backend en Laravel sobre PostgreSQL, que ofrece una API RESTful documentada con Swagger para facilitar la integración y escalabilidad. Cuenta con autenticación segura mediante tokens JWT, gestión avanzada de roles y permisos, paginación y filtros optimizados para manejar grandes volúmenes de datos. Incluye un sistema completo de carrito de compras integrado con Mercado Pago para procesamiento de pagos, junto con control dinámico de stock y un panel administrativo para gestionar productos, usuarios y ventas en tiempo real.",
        "image": "/assets/ecommerce.png",
        "link": "https://arce-diz-js.vercel.app/"
    },
    {
        "id": 3,
        "title": "Police Chase",
        "description": "Versión personalizada de Pac-Man desarrollada en Java, con interfaz gráfica, manejo de colisiones, control por teclado y lógica concurrente mediante hilos. Se aplicaron patrones de diseño como Singleton, Visitor y Abstract Factory para una estructura flexible y escalable. ",
        "image": "/assets/pac-man.JPG",
        "link": "https://github.com/tomasdg9/tdp-proyecto-3"
    },
    {
        "id": 4,
        "title": "MOV3S",
        "description": "Aplicación móvil para Android e IOS desarrollada con React Native (Expo), enfocada en promover la sustentabilidad y reducir la huella de carbono. La app permite crear recorridos a pie, en bicicleta o mediante autocompartido, participar en desafíos y trivias, y generar alertas sobre robos, incidentes u obstrucciones en la vía pública. Integra un chatbot personalizado y notificaciones push mediante Firebase. El ecosistema se completa con una web informativa desarrollada con Bootstrap Studio, un backend en PHP con base de datos SQL, y un dashboard desarrollado en Next.js para el análisis y visualización de datos.",
        "image": "/assets/mov3s.png",
        "link": "https://mov3s.com/"
    },
    {
        "id": 5,
        "title": "Sistema de Gestión de Ventas y Stock",
        "description": "Sistema web para supermercados que permite administrar productos, stock y ventas con reglas de negocio estrictas. Implementa carrito de ventas, estados, control transaccional de stock y validaciones desde backend. Arquitectura cliente–servidor con frontend moderno y backend robusto orientado a integridad de datos.",
        "image": "/assets/supermarket.png",
        "repoFrontend": "https://github.com/ezearce/supermarket-dash",
        "repoBackend": "https://github.com/ezearce/system"
    }
]